Tekla.Structures.Model.PourObject
The PourObject class represents a pour object in the model.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
public void Example1()
{
Beam beam = new Beam(new Point(1000, 1000, 400), new Point(3000, 1000, 400));
beam.Profile.ProfileString = "380*380";
beam.Material.MaterialString = "K40-1";
beam.CastUnitType = Part.CastUnitTypeEnum.CAST_IN_PLACE;
if (beam.Insert())
{
Beam beam2 = new Beam(new Point(800, 1000, 0), new Point(800, 1000, 3000));
beam2.Profile.ProfileString = "380*380";
beam2.Material.MaterialString = "K40-1";
beam2.CastUnitType = Part.CastUnitTypeEnum.CAST_IN_PLACE;
if (beam2.Insert())
{
new Model().CommitChanges();
ModelObjectEnumerator pours = beam.GetPours();
while(pours.MoveNext())
{
PourObject pour = pours.Current as PourObject;
if(pour != null)
{
Solid solid = pour.GetSolid();
if(solid != null)
Console.WriteLine("Fetching solid from pour successfully!");
}
}
}
}
}
}

Tekla.Structures.Model.PourObject.#ctor
Initializes a new instance of the Tekla.Structures.Model.PourObject class.

Tekla.Structures.Model.PourObject.Class
Gets or sets the class of the pour object.

Tekla.Structures.Model.PourObject.PourNumber
Gets or sets the pour number of the pour.

Tekla.Structures.Model.PourObject.PourType
Gets or sets the pour type of the pour.

Tekla.Structures.Model.PourObject.ConcreteMixture
Gets or sets the concrete mixture of the pour.

Tekla.Structures.Model.PourObject.Insert
At the moment pour objects cannot be inserted.
Returns: Returns false.

Tekla.Structures.Model.PourObject.Select
Selects the pour object instance from the model. The identifier of the instance must be set.
Returns: True on success.

Tekla.Structures.Model.PourObject.Modify
Modifies the pour object with the given identifier.
Returns: True on success.

Tekla.Structures.Model.PourObject.Delete
At the moment pour objects cannot be deleted.
Returns: Returns false.

Tekla.Structures.Model.PourObject.GetSolid
Returns the solid of the pour object.
Returns: The solid of the pour object.

Tekla.Structures.Model.PourObject.GetPourPolymeshes
Returns a new polymesh enumerator based on merged faces of the pour object in the current plane.
Returns: A polymesh enumerator to enumerate through the solid's faces after merging based on pour object.

Tekla.Structures.Model.PourObject.GetParts
Returns an enumerator of all parts related to pour.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.PourObject.GetObjects
Returns an enumerator of all objects related to pour.
Returns: A model object enumerator on success, otherwise null.
Deprecated since TS v2018.

Tekla.Structures.Model.PourObject.GetFatherPourUnit
Returns the pour unit that the pour object belongs to.
Returns: a pour unit.

Tekla.Structures.Model.PourObject.GetSurfaceObjects
Returns an enumerator of all the connected surface objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.PourObject.GetAssembly
Returns the assembly that the pour object belongs to.
Returns: The assembly that the pour object belongs to.
Deprecated, use GetFatherPourUnit instead

Tekla.Structures.Model.PourObject.ToStruct(Tekla.Structures.ModelInternal.dotPourObject_t@)
To the structure.
pourObject: The pourObject.

Tekla.Structures.Model.PourObject.FromStruct(Tekla.Structures.ModelInternal.dotPourObject_t@)
Froms the structure.
pourObject: The pourObject.

Tekla.Structures.Model.PourObject.SelectInstance
Selects the instance.
Returns: Returns true if can be selected.

Tekla.Structures.Model.PourObject.ModifyInstance
Modifies the instance.
Returns: Returns true if modified.